# Отримуємо розмір квадратної матриці від користувача та перевіряємо, чи він непарний
nRows = int(input("Введіть розмір квадратної матриці: "))
if nRows % 2 == 0:
    raise Exception("Введіть непарний розмір.")  # Викидаємо помилку, якщо розмір парний

arr = []  # Список для зберігання рядків матриці

# Ініціалізація змінних для побудови структури матриці
x = 1  # Початкова кількість елементів у рядку
y = 0

# Формування верхньої частини трикутної матриці
while y < nRows // 2 + 1:
    arr.append([''] * x)  # Додаємо новий рядок з збільшеною кількістю елементів
    x += 2
    y += 1

# Формування нижньої частини трикутної матриці
x -= 4  # Щоб перейти до зменшення кількості елементів
while x > 0:
    arr.append([''] * x)  # Додаємо новий рядок з зменшеною кількістю елементів
    x -= 2

# Отримуємо від користувача символ для заповнення матриці
filler = input("\nВведіть символ-заповнювач: ")

# Заповнення матриці символом та виведення її на екран
for i in range(len(arr)):
    spaces = " " * ((nRows - len(arr[i])) // 2 * 2)  # Відступ для вирівнювання по центру
    print(spaces, end="")  # Виводимо поточний відступ

    # Заповнюємо поточний рядок матриці символом-заповнювачем
    for j in range(len(arr[i])):
        if len(filler) == 1:
            arr[i][j] = filler[0]  # Заповнюємо елемент символом
            print(arr[i][j], end=" ")
        elif len(filler) == 0:
            print("\nНе введено символ-заповнювач")  # Повідомлення про відсутність символу
            break
        else:
            print("\nЗабагато символів-заповнювачів")  # Повідомлення про надлишкові символи
            break
    print("\n")  # Перехід на новий рядок

# Запис матриці у файл MyFile.txt
with open("MyFile.txt", "w") as fout:
    for i in range(len(arr)):
        spaces = " " * ((nRows - len(arr[i])) // 2 * 2)  # Відступ для вирівнювання по центру
        fout.write(spaces)  # Записуємо відступ

        # Записуємо рядок матриці у файл
        for j in range(len(arr[i])):
            if len(filler) == 1:
                arr[i][j] = filler[0]
                fout.write(arr[i][j] + " ")
            elif len(filler) == 0:
                fout.write("\nНе введено символ-заповнювач")
                break
            else:
                fout.write("\nЗабагато символів-заповнювачів")
                break
        fout.write("\n")  # Перехід на новий рядок у файлі
